In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("employee_records.csv")

In [4]:
df.head(10)

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
0,1,Daniel Taylor,25,UK,HR,Analyst,142278.32,2023-06-04
1,2,Ethan Brown,44,India,Marketing,Executive,98549.20,2018-01-13
2,3,Sophia Martinez,51,Japan,Finance,Developer,85565.84,2015-04-30
3,4,Ethan Martinez,47,Germany,Support,Analyst,34513.67,2015-06-17
4,5,Mia Brown,32,Australia,Support,Consultant,45339.72,2019-02-22
5,6,Ava Moore,35,Japan,HR,Executive,90973.25,2018-09-29
6,7,Mason Brown,48,UK,Finance,Assistant,58227.95,2021-08-24
7,8,Mason Anderson,45,USA,Finance,Manager,147839.10,2021-01-08
8,9,Sophia Wilson,40,Brazil,Marketing,Developer,126394.86,2018-12-20
9,10,Ava Martinez,40,India,Sales,Manager,119828.28,2018-05-18

In [5]:
df.shape

(30000, 8)

1. Get all records of employees from the UK.

In [6]:
df[df['Country'] == "UK"]

,Employee_ID,Employee_Name,Age,Country,Department,Position,Salary,Joining_Date
0,1,Daniel Taylor,25,UK,HR,Analyst,142278.32,2023-06-04
6,7,Mason Brown,48,UK,Finance,Assistant,58227.95,2021-08-24
20,21,Sophia Brown,49,UK,Finance,Consultant,68754.50,2022-08-24
29,30,Sophia Martinez,52,UK,Sales,Manager,138677.05,2022-08-03
65,66,Logan Brown,59,UK,Sales,Manager,91702.79,2020-07-14
...,...,...,...,...,...,...,...,...
29952,29953,Mason Wilson,24,UK,Engineering,Analyst,39309.52,2019-06-06
29959,29960,Ava Taylor,45,UK,HR,Developer,32171.67,2018-08-13
29974,29975,Ava Martinez,42,UK,Support,Consultant,31018.49,2021-05-02
29977,29978,Mia Jackson,27,UK,HR,Developer,33272.65,2016-04-27
29988,29989,Emma Thomas,51,UK,HR,Assistant,134599.76,2018-05-28

2. Retrieve the list of distinct departments.

In [9]:
df['Department'].unique().tolist()

['HR', 'Marketing', 'Finance', 'Support', 'Sales', 'Engineering']